/******************************************************************************

Определить периметр треугольника, заданного координатами его
вершин. Координаты вершин ввести с клавиатуры.
*******************************************************************************/

#include <iostream>
#include <math.h>
#include <cmath>
using namespace std;

int main()
{
    float x1, x2, x3, y1, y2, y3;
    float a,b,c, p;
    
    
    cout<<"x1 = ";
    cin >> x1;
    
    cout<<"y1 = ";
    cin >> y1;
    
    cout<<"x2 = ";
    cin >> x2;
    
    cout<<"y2 = ";
    cin >> y2;
    
    cout<<"x3 = ";
    cin >> x3;
    
    cout<<"y3 = ";
    cin >> y3;
    
    a = sqrt((x2 - x1)*(x2-x1) + (y2 - y1)*(y2-y1));
    b = sqrt((x3 - x2)*(x3-x2) + (y3 - y2)*(y3-y2));
    c = sqrt((x1 - x3)*(x1-x3) + (y1 - y3)*(y1-y3));
    
    p = a+b+c;
    
    cout << "p = " << round(p *1000)/1000;
    
    return 0;
}
